Tekla Open API Reference for Tekla Structures 2025
AnalysisPartSpanningProperties Properties
The AnalysisPartSpanningProperties type exposes the following members.
Properties
Name | Description
SpanningDirection
 The spanning direction (in the global coordinate system).
SpanningType
 The spanning type.
Top
See Also
Reference
AnalysisPartSpanningProperties Class
Tekla.Structures.Analysis Namespace